import React, { Component } from "react"
import InfoPage from "./InfoPage"
import { faq_label } from "../../config"

export default class Faq extends Component {
  constructor(props) {
    super(props)
  }

  render() {
    return (
      <InfoPage
        animation={this.props.animation}
        content={
          <div>
            <h5>{faq_label}</h5>
            <p style={{ fontSize: 18 }}>
              <p style={styles.question}>რა არის სლამი?</p>
              <p style={styles.answer}>
                Slami.ge არის ონლაინ პლათფორმა რომელიც საშუალებას იძლევა ინტერაქციულ რეჟიმში სურათებით
                და სათაურებით დროის მცირე დროში <strong>მარტივად</strong> შექმნათ ვიდეო სოციალაური მედიისთვის.
              </p>

              <p style={styles.question}>ფასიანია?</p>
              <p style={styles.answer}>
                <strong>არა. </strong>ჩვენი მიზანია რომ პლატფორმა იყოს ყველასთვის მარტივად ხელმისაწვდომი და
                სწრაფი. ნებისმიერ ადამიანს უნდა შეეძლოს მარტივად ვიდეოების შექმნა და სლამის გამოყენება არ იქნება
                შეზღუდული. იგეგმება პრემიუმ ფუნქციების ჩამატება სლამიშიც, რომლებიც იქნება უმნიშვნელო; ეს მისცემს
                საშუალებას მომხმარებლებს რომ სლამის განვითარებაში წვლილი შეიტანონ და სამაგიეროდ პატარა ბონუსები
                მიიღონ, თუმცა სლამის გამოყენება იქნება უფასო.
              </p>

              <p style={styles.question}>სად შეიძლება გამოვიყენო სლამის ვიდეო?</p>
              <p style={styles.answer}>
                Slami.ge ზე შექმნილი ვიდეო შეგიძლიათ გამოიყენოთ სოციალური მედიისთვის, მათ შორის
                Facebookისთვის. სწორედ ამიტომ აგენერირებს სლამი მხოლოდ კვადრატულ ვიდეოებს.
              </p>

              <p style={styles.question}>როგორ შევქმნა ვიდეო?</p>
              <p style={styles.answer}>
                ვიდეოს შესაქმნელად საჭიროა დაწეროთ ტექსტი, რომელიც გსურთ რომ ვიდეოში გამოჩნდეს. ამ
                ასათაურებისთვის რელევანტურ მედია კონტენტს დაძებნის სლამი და ავტომატურად გიჩვენებთ
                გვერდის მარჯვენა ნახევარში. შემდგომ ამოარჩევთ თქვენს სასურველ მედიას ან ატვირთავთ საკუთარი
                ფაილებიდან, გადახვალთ შემდეგ გვერდზე და სათითაო სლაიდს დაარედაქტირებთ. ღილაკი "დააგენერირე"
                დაამზადებს ვიდეოს, რომელიც შეგიძლიათ ჩაიწეროთ და გამოიყენოთ როგორც გსურთ.
              </p>

              <p style={styles.question}>რამდენი წუთი სჭირდება ვიდეოს შექმნას?</p>
              <p style={styles.answer}>
                ჩვენს პლათფორმაზე რამოდენიმე წუთი (3-4) არის საჭირო რომ შექმნათ ვიდეო სურათებისგან,
                მიანიჭორთ შესაბამისი სათაურები და გააზიაროთ ის სოციალურ მედიაში.
              </p>

              <p style={styles.question}>ვისთვის არის Slami.ge?</p>
              <p style={styles.answer}>
                Slami.ge განკუთვნილია ჟურნალისტებისთვის, მედია სივრცეში დასქმებული ადამიანებისთვის და
                მათთვის ვისაც მოვლენების სწაფი და მარტივი გაშუქების ონლაინ არხი სჭირდებათ.
              </p>

              <p style={styles.question}>საავტორო უფლებები დაცულია?</p>
              <p style={styles.answer}>
                ჩვენი საიტი იყენებს Microsoft Bing-ის საძიებო სისტემას. შესაბამისად, ფოტოების საავტორო
                უფლებები განსაზღვრულია Bing ის მიერ და სლამი არის მხოლოდ შუამავალი პლათფორმა.
                მომხმარებლებს ვთხოვთ რომ გამოიყენონ სლამის მიერ მოწოდებული კონტენტი ყველანაირი საავტორო
                უფლების დაცვით. Slami.ge/სლამი არ არის პასუხისმგებელი როგორ გამოიყენებენ მომხმარებლები
                პლატფორმის მიერ მიწოდებულ მედიას.
              </p>
            </p>
          </div>
        }
      />
    )
  }
}

const styles = {
  question: {
    fontSize: 23,
    marginBottom: 3
  },
  answer: {
    marginTop: 0
  }
}